using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace gradove
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void благоевградToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("1.jpg");
            textBox1.Text = "Благоевград е икономически, културен и образователен център на Югозападна България и административен център на едноименните област и община. Според преброяване на Националния статистически институт към 31 декември 2018 година, градът е с население от 69 178 души.";
        }

        private void бургасToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("2.jpg");
            textBox1.Text = "Бургас е най-големият град в Югоизточна България и вторият по големина на българското Черноморие, а със своето землище от 253,644 km², той е вторият град по площ в България . Според последното преброяване на НСИ към 31 декември 2018 г. населението е 203 962 жители и така продължава да е четвъртият по големина град в страната . Бургас е най-важният културен, стопански, транспортен, управленски, туристически и просветен център в Югоизточна България.";
        }
        private void варнаToolStripMenuItem1_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("3.jpg");
            textBox1.Text = "Варна е най-големият град в Североизточна България, разположен по бреговете на Черно море и Варненското езеро и е административен център на едноименните община и област. Той е най-големият град в Северна България и по българското Черноморие. Населението на града по сведения на НСИ към 31 декември 2018 г. се изчислява на 336 505 души, което поставя Варна на трето място в България (след София и Пловдив). На територията му е разположено Адмиралтейството на Българската армия.";
        }

        private void великоТърновоToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("4.jpg");
            textBox1.Text = "Велико Търново е град с население от 68 859 души, намиращ се в Северна България, център на едноименната област, както и на Северен централен регион. Градът е столица на Втората българска държава и на Княжество България в периода 1878 – 1879 г. През Средновековието носи името Търновград, като постепенно става известен с наименованието Търново. През 1963 г. пред него е добавено „Велико“ в чест на предишната слава на града. Благодарение на богатото си културно-историческо наследство Велико Търново е важен туристически център.";
        }

        private void видинToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("5.jpg");
            textBox1.Text = "Вѝдин е областен и общински град в Северозападна България , с население от 41 583 души, разположен по поречието на река Дунав. Той е административен и стопански център на едноименните община Видин и област Видин.";
        }

        private void врацаToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("6.jpg");
            textBox1.Text = "Враца  е най-големият град в Северозападна България с население към 2018 г. 52 617 души. Административен и стопански център на едноименните община Враца и област Враца. Намира се на около 112 km северно от София, 40 km югоизточно от Монтана.";
        }

        private void габровоToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("7.jpg");
            textBox1.Text = "Габрово е град в централна България , с население от 52 169 души, административен и стопански център на едноименните община Габрово и област Габрово. Разположен е по поречието на река Янтра в северното подножие на Шипченския дял на Стара планина. В непосредствена близост до него, в местността Узана, се намира географският център на България.";
        }

        private void добричToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("8.jpg");
            textBox1.Text = "Добрич е град в Североизточна България, административен и стопански център на област Добрич и община Добрич. Той е разположен в южната част на географския район Добруджа, на 34 km от Балчик и на 45 km от Варна. Населението на града към 31.12.2018 г. е 83 584 жители (девето място в страната).";
        }

        private void кърджалиToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("9.jpg");
            textBox1.Text = "Кърджали е град в Южна България. Той е център на област Кърджали и на община Кърджали. Населението на град Кърджали към 31.12.2018 г. е 43 263 души. Намира се на 47 km от град Хасково, на 84 km от град Смолян, на 95 km от град Пловдив, на 111 km от град Стара Загора, на 243 km от София, на 78 km от Гюмюрджина и на 383 km от Истанбул.";
        }

        private void кюстендилToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("10.jpeg");
            textBox1.Text = "Кюстендѝл е град в Югозападна България, административен център на едноименната област и община.Намира се в близост до границата с Република Северна Македония и с Република Сърбия. Балнеоложки и туристически център с национално и международно значение, археологически и архитектурен резерват, изходен пункт за туризъм и ски спорт в планината Осогово.Населението на Кюстендил е 39 881 жители към 31 декември 2018 година.";
        }

        private void ловечToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("11.jpg");
            textBox1.Text = "Ловеч е град в Централна Северна България. По време на османската власт е наричан „Алтън Ловеч“ – „Златният Ловеч“. Днес Ловеч е административен и стопански център на едноименните община Ловеч и област Ловеч. Населението на града по данни на НСИ към 31.12.2018 г. е 32 263 жители.";
        }

        private void монтанаToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("12.jpg");
            textBox1.Text = "Монтана е областен град в Северозападна България, административен и стопански център на едноименните община Монтана и област Монтана. Населението на града е 39 240 жители според оценка на НСИ към 31.12.2018 г.";
        }

        private void пазарджикToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("13.jpg");
            textBox1.Text = "Пазарджик е областен град в Южна България, административен център на община Пазарджик и на област Пазарджик. Намира се на 37 km западно от Пловдив и на 112 km югоизточно от София. Лежи на двата бряга на река Марица в западната част на Горнотракийската низина и е вторият най-важен културен и административен център в Южна Централна България. Последното преброяване на НСИ към края на 2018 г. оценява населението на града на 68 194 жители.";
        }

        private void перникToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("14.jpg");
            textBox1.Text = "Перник е град в Западна България, административен център на област Перник и община Перник. По последни данни на НСИ към 31.12.2018 г.населението му наброява 73 111 души, което го прави най-многочисления град в Западна България след столицата София и го нарежда на 11 - то място в страната.";
        }

        private void плевенToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("15.jpg");
            textBox1.Text = "Плевен (до 1945 г. Плѣвенъ) е град в Централна Северна България. Той е административен център на едноименните община Плевен и област Плевен, както и един от важните културни, образователни, икономически и транспортни центрове в страната. Плевен и неговата околност имат корени от дълбока древност и практически непрекъснато хилядолетно развитие. В края на 2018 г. населението на града се оценява на 96 610 души.";
        }

        private void пловдивToolStripMenuItem1_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("16.jpg");
            textBox1.Text = "Пловдив е вторият по големина град в България с население 346 893 души по настоящ адрес (към 31.12.2018 г.).Намира се в западната част на Горнотракийската низина, на двата бряга на река Марица. Отстои на 15 km северно от Родопите и на 50 km южно от Стара планина. Градът е застроен в подножията на шест сиенитни хълма, поради което често е наричан „Градът под тепетата“. Пловдив е управленски център на област Пловдив, община Пловдив, община Марица, община Родопи и е най-голямото стопанско ядро на Южния централен район.";
        }

        private void разградToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("17.jpg");
            textBox1.Text = "Разград е град, разположен в Североизточна България. Той е административен център на община Разград, област Разград. Разположен е в южната част на историко-географска област Лудогорие. Според последното преоброяване на НСИ към 31.12.2018 година населението на град Разград е 30 575 жители.";
        }

        private void русеToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("18.jpg");
            textBox1.Text = "Русе е най-големият български град по поречието на река Дунав и петият град по големина в страната. Разположен е на североизточната граница на страната с Румъния. Градът е административен център на община Русе и област Русе, както и икономически, транспортен, културен и образователен център от регионално и национално значение. Населението на Русе е 142 902 души (по данни на НСИ към 31.12.2018 г.).";
        }

        private void силистраToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("19.jpg");
            textBox1.Text = "Силистра е пристанищен град на река Дунав в Североизточна България. Той е административен и стопански център на едноименните община Силистра и област Силистра. Според последното преброяване на НСИ към 31.12.2018 г. , населението е 31 468 жители.";
        }

        private void сливенToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("20.jpg");
            textBox1.Text = "Сливен е град в Югоизточна България, разположен в близост до Ямбол и Нова Загора. Той е осмият по големина в страната и е административен център на община Сливен и област Сливен. Най-големият град в Югоизточна България – Бургас, отстои на 113 km в източна посока от града. Сливен е известен като Градът на стоте войводи, свързани с хайдушкото движение.";
        }

        private void смолянToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("21.jpg");
            textBox1.Text = "Смолян е град в Южна България. Намира се в Переликско-Преспанския дял на Западни Родопи при голяма надморска височина – 1035 m. Градът е образуван на 18 юни 1960 г. от двата града Смолян и Устово, и селата Райково и Езерово.Той е административен център на община Смолян и област Смолян и има население от 27 505 души.";
        }

        private void софияградToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("22.jpg");
            textBox1.Text = "София е столицата и най-големият град в България. Тя е 14-ият по големина град в Европейския съюз, с население 1 241 675 души (2019).По резултатите от преброяването през 2011 г. населението на града е 1 291 591, което представлява 17,5% от населението на България. София е разположена в централната част на Западна България, в Софийската котловина, и е заобиколена от планини: Витоша на юг, Люлин на запад и Стара планина на север. Това я прави четвъртата по височина столица в Европа. Изградена е върху четирите тераси на река Искър и нейните притоци: Перловска и Владайска (Елешница). В централната градска част, както и в кварталите Овча купел, Княжево, Горна баня и Панчарево, има минерални извори. Климатът на София е умереноконтинентален.";
        }

        private void софияобластToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("23.jpg");
            textBox1.Text = "Софийска област е област в България.Заема площ от 7059 km², има население 247 489 души(по данни от преброяване 2011).Пощенските кодове на населените места в Софийска област са от 2000 до 2299.МПС - кодът ѝ е СО.";
        }

        private void стЗагораToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("24.jpg");
            textBox1.Text = "Стара Загора е град в Южна България, един от основните икономически центрове в страната, както и основен транспортен възел на Южна България. Той е център на едноименните община, област и регионална асоциация на общините РАО Тракия. Градът е шестият по големина в страната с население от 135 715 души по данни на НСИ към 31.12.2018 г. и образува петата по големина градска агломерация в България с население от 213 444 жители (към септември 2007 г.) , както и център на 5-ата по големина област в България с население към 31 декември 2016 г. от 321 377 души. Стабилното икономическо развитие на региона му отрежда второ място по БВП на глава от населението в страната.";
        }

        private void търговищеToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("25.jpg");
            textBox1.Text = "Търговище  е областен град в Североизточна България, административен и стопански център на едноименната община Търговище и област Търговище. Населението на града към 31.12.2018 г. е 35 453 жители.";
        }

        private void хасковоToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("26.jpg");
            textBox1.Text = "Хасково е град в централна Южна България. Той е административен център на община Хасково и област Хасково. Според последните данни на НСИ, към 31 декември 2018 г. , Хасково е с население 70 406 души и е 12-ият по големина град в страната.";
        }

        private void шуменToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("27.jpg");
            textBox1.Text = "Шумен  е град в Североизточна България, административен и стопански център на едноименните община Шумен и област Шумен. Градът е десети по големина в страната с население от 75 500 жители към 31.12.2018 г.";
        }

        private void ямболToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("28.jpg");
            textBox1.Text = "Ямбол е град в Югоизточна България. Той е административен център на област Ямбол, както и център и единствено населено място на община Ямбол. Според последното преброяване на НСИ към 31.12.2018 г. населението на града е 68 074 души.";
        }

        private void казанлъкToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("29.jpg");
            textBox1.Text = "Казанлък е град в централна България, административен център на едноименната община в област Стара Загора. Населението му е 45 367 души, което го поставя на 2-ро място в областта и на 20-то в страната. Казанлък е и вторият по големина необластен град в България, след Асеновград.Казанлък е център на Розовата долина. В града се намира най - голямата и най-добре запазена в страната Тракийска гробница, включена в списъка на ЮНЕСКО и Музеят на розата.Наблизо е античният град Севтополис и Долината на тракийските царе.";
        }

        private void дупницаToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("30.jpg");
            textBox1.Text = "Дупница е град в Югозападна България, административен център на община Дупница, област Кюстендил. Градът отстои на ок. 40 km източно от областния град Кюстендил и е втори по големина след него. Според преброяването през 2011 г. в Дупница живеят 33 519 жители, а според ГРАО през септември 2011 г. има 38 519 жители, регистрирани по настоящ и 42 104 по постоянен адрес.В града и околностите има средновековни църкви, следи от тракийска култура, некрополи (могили), стара часовникова кула, останки от римска гробница и средновековна крепост.";
        }

        private void петричToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("31.jpg");
            textBox1.Text = "Петрич е град в Югозападна България. Той се намира в област Благоевград и е в близост до границите с Гърция и Северна Македония. Градът е втори по големина в областта след Благоевград и е административен център на община Петрич.Градът е най-известен с Природен парк Беласица , къщата музей на Баба Ванга и исторически музей. ";
        }

        private void бъргасToolStripMenuItem_Click(object sender, EventArgs e)
        {

        }

        private void варнаToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("33.jpg");
            textBox1.Text = "Международно летище Варна се намира на северното черноморско крайбрежие, на 7,5 км от гр. Варна.Летището е разположено западно от центъра на града, на територията на 2 общини (Варна и Аксаково). Площта му е 2414 дка. Разполага с 5 пътеки за рулиране и 24 самолетни стоянки за машини с код Е, D, C, C-1, C+1. Най-големият тип самолет, който обслужва летището, е „Боинг 747“. Кацането по писта 09 (от запад) може да се осъществява в условията на намалена видимост по първа категория CAT I.";
        }

        private void софияToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("34.jpg");
            textBox1.Text = "Международно летище София , известно още като Аерогара София, е най-голямото летище в България. То е разположено на около 10 km източно от центъра на столицата и се стопанисва от едноименното дружество „Летище София“ ЕАД. Летището е възел за националния превозвач – авиокомпания „България Ер“. През 2019 година през летището преминават рекордните 7 107 096 пътници, което е с 2% повече от облсужената бройка през 2018 година. Годишният анализ показва, че по международни редовни линии са пътували 93% от общия пътникопоток, 4% са пасажерите по вътрешни линии, а 3% са използвали чартърни полети.";
        }

        private void пловдивToolStripMenuItem_Click(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("35.jpg");
            textBox1.Text = "Летище Пловдив или Летище Крумово е летището на втория по големина град в България, Пловдив. Разположено е югоизточно от града и съчетава функциите на международно гражданско летище и военна авиобаза на Военновъздушните сили.През 1961 г. на Летище Крумово е сформиран вертолетен авиополк (44-и ВАП), преобразуван през 1981 г. в 24-та авиационна база.";
        }


        private void бъргасToolStripMenuItem_Click_1(object sender, EventArgs e)
        {
            pictureBox1.Image = Image.FromFile("32.jpg");
            textBox1.Text = "Летище Бургас е международно летище в България, обслужващо град Бургас и прилежащия регион.Разположено е в бургаския квартал Сарафово, на 10 км североизточно от центъра на града. Летището заема 2 - ро място по пътникопоток в страната след Летище София. През 2018 г.са обслужени 3 277 229 пътници.Летището е с най-голям брой слънчеви дни в Европа, а след разширението на летищата в София, Атина и Белград е с 4-та по дължина писта (3200 м) на Балканския полуостров.";
        }
    }
}
